## Getting Started with SQL

Databases are everywhere!

Even though, when learning data science you’ve only dealt with CSVs, that will hardly resemble reality since most companies tend to store data into databases.

### What is SQL ? 

- SQL stands for Structured Query Language
- SQL lets you access and manipulate databases

### What Can SQL do for you ?

- SQL can execute queries from databases - That means you can ask questions from the database and it will answer you !
- You can extract data and information from the database and use it
- You can Insert your own data into the databases

And so Much more! That this notebook will help you accomplish

## Components of a SQL ecosystem 

Any SQL system has one major component that is the database  

Databases ⇉ Tables ⇉ Queries

In [ ]:
## Getting some pip libraries incase your environment does not have it 
!pip3 install ipython-sql
!pip3 install sqlalchemy-utils

## Set up your own MySQL Server 

To get started with SQL first you need local SQL-based service running on your system to get this done we will be implementing a Mysql server so that you can get started with creating and interacting with your databases 

### If you are a MAC user 

Download the pkg from from the this link https://dev.mysql.com/doc/refman/5.7/en/osx-installation-pkg.html

Follow the steps along to have a server running on your local server 
During the steps you might have created a project -> for this setup use the password as "musu1234" So that we have default value to use in this set up process

In your terminal perform the command

#### /usr/local/mysql/bin/mysql -u root -p

Once inside the mysql

#### create database techisDB;

### If you are a Windows user

#### Note : Have not tested yet , will make a window VM and test soon

For windows , download from https://dev.mysql.com/downloads/installer/ and install for the architecture that your hardware supports

Another source that helps in intial set up is https://dev.mysql.com/doc/mysql-getting-started/en/

On Windows, click Start, All Programs, MySQL, MySQL 5.7 Command Line Client

And then in the environment 

#### C:\> mysql -u root -p

and when inside , create our reference database

#### create database techisDB;

## Connecting to your MySQL Server

Now we are going to access and work on the SQL system that we have set up inside the python environment using the mysql library

In [ ]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

connection = mysql.connector.connect(host='localhost',
                                    database='techisDB',
                                    user='root',
                                    password='musu1234')

## CREATE Table Queries

Before you start using your SQL , let us create a table to get started

In [ ]:
mySql_Create_Table_Query = """CREATE TABLE Laptop( 
                             Id int(11) NOT NULL,
                             Name varchar(250) NOT NULL,
                             Price float NOT NULL,
                             Purchase_date Date NOT NULL,
                             PRIMARY KEY (Id)) """
        
cursor = connection.cursor()
result = cursor.execute(mySql_Create_Table_Query)
print("Laptop Table created successfully ")

Laptop Table created successfully

## INSERT Queries

In [ ]:
mySql_insert_query = """INSERT INTO Laptop (Id, Name, Price, Purchase_date) 
                        VALUES 
                        (10, 'Lenovo ThinkPad P71', 6459, '2020-08-14') """

cursor = connection.cursor()
cursor.execute(mySql_insert_query)
connection.commit()
print(cursor.rowcount, "Record inserted successfully into Laptop table")
cursor.close()

1 Record inserted successfully into Laptop table

True

Now let's make this process much easier by creating a python function that helps us add more records into our Laptop table more easily!

In [ ]:
def insertVariblesIntoTable(id, name, price, purchase_date):
    cursor = connection.cursor()
    mySql_insert_query = """INSERT INTO Laptop (Id, Name, Price, Purchase_date) 
                            VALUES (%s, %s, %s, %s) """

    recordTuple = (id, name, price, purchase_date)
    cursor.execute(mySql_insert_query, recordTuple)
    connection.commit()
    print("Record inserted successfully into Laptop table")


insertVariblesIntoTable(2, 'Area 51M', 6999, '2019-04-14')
insertVariblesIntoTable(3, 'MacBook Pro', 2499, '2019-06-20')

Record inserted successfully into Laptop table
Record inserted successfully into Laptop table

## SELECTING data from SQL

In [ ]:
# To check some version of our DB
db_Info = connection.get_server_info()
print("Connected to MySQL Server version ", db_Info)

cursor = connection.cursor()
cursor.execute("select * from techisDB.Laptop")
query = cursor.fetchall()
PylibDB = pd.DataFrame(query, columns=cursor.column_names)

display(PylibDB)

Connected to MySQL Server version  8.0.20

   Id                 Name   Price Purchase Data
0   2             Area 51M  6999.0    2019-04-14
1   3          MacBook Pro  2499.0    2019-06-20
2  10  Lenovo ThinkPad P71  6459.0    2020-08-14